package bitOperators

import "fmt"

func Start() {
	var x uint8 = 1<<1 | 1<<5
	var y uint8 = 1<<1 | 1<<2
	fmt.Printf("%08b\n", x)    // "00100010", множество {1,5}
	fmt.Printf("%08b\n", y)    // "00000110", множество {1,2}
	fmt.Printf("%08b\n", x&y)  // "00000010", пересечение {1}
	fmt.Printf("%08b\n", x|y)  // "00100110", объединение {1,2,5}
	fmt.Printf("%08b\n", x^y)  //"00100100", симметричная разность {2,5}
	fmt.Printf("%08b\n", x&^y) // "00100000", разность {5}
	for i := uint(0); i < 8; i++ {
		if x&(1<<i) != 0 {
			// Проверка принадлежности множеству
			// "1", "5"
			fmt.Println(i)
		}
	}

	fmt.Printf("%08b\n", x<<1) //"01000100", множество{2, 6}
	fmt.Printf("%08b\n", x>>1) //"00010001", множество{0, 4}

}
